/*Да се напише програма во која се читаат знаци од тастатура сè додека не се прочита знакот ‘.’.
 Програмата треба да ги отпечати на екран знакот кој е внесен најмногу пати последователно како
 и бројот на последователни внесувања. Ако повеќе знаци имаат ист број на последователни внесувања
 да се отпечати првиот внесен знак со најмногу повторувања.*/
#include <stdio.h>
int main()
{
    char znak,z,t;
    int pv=1,np=0;

    printf("Vnesuvaj znaci: ");
    scanf("%c" , &znak);
    z=znak;

    while(znak!='.')
    {

        scanf("%c" , &znak);

        if(znak==z)
        {
            pv++;
        if(pv>np)
        {
            np=pv;
            t=znak;
        }
        }
        else
        {
            pv=1;
            z=znak;
        }

    }
    printf("Znakot %c e vnesen %d pati " , t , np);
}
