/*Од тастатура се читаат 2 позитивни цели броеви, поголеми од 0. Доколку се внесе барем еден
негативен број или 0 треба да се печати „Invalid input“.
Треба да се определи дали помалиот број “е непарен еквивалент” од поголемиот број.
Еден број “е непарен еквивалент” на друг број, ако и само ако неговите цифри се наоѓаат на
непарните позиции од другиот број, во истиот редослед. Соодветно да се испечатат пораки
„DA“ и „NE“.
Позициите треба да се сметаат оддесно-налево (најмалку значајната цифра е на позиција 1)*/
#include <stdio.h>
#include <stdlib.h>
int main()
{
    int m,n,t,flag=0;
    scanf("%d%d" , &m , &n);
    if(m>n)
    {
        t=m;
        m=n;
        n=t;
    }
    if(m<=0 || n<=0)
        printf("Invalid input");
    else
    {
        while(m)
        {
            if(m%10!=n%10)
            {
                flag=1;
                printf("NE");
                break;
            }
            m/=10;
            n/=100;
        }
    if(flag==0)
        printf("DA");
    }
}

