#include <stdio.h>
#include <stdlib.h>
/*Скриен хексадецимален број Problem 4 (6 / 6)
Од тастатура се читаат непознат број на знаци се додека не се внесе знак за нов ред.
Во рамките на текстот се скриени хексадецимални цифри (цифри од 0-9 и А-F).
Да се состави и отпечати хексадецималниот број кој е соодветен на прочитаните цифри и да се испечати неговиот декаден еквивалент.
Задачата да се реши без употреба на полиња.*/
int main() {
    int br=0;
    char c;
    while((c=getchar())!='\n')
    {
        if((c>='A'&&c<='F')||c>='0'&&c<='9')
        {
            printf("%c",c);
            if(c>='A'&&c<='F')
                br=br*16+(c-'A'+10);
            else
                br=br*16+(c-'0');
        }
    }
    printf(" %d\n",br);
    return 0;
}
